Tekla Open API Reference for Tekla Structures 2025
AnalysisPartCompositeProperties Properties
The AnalysisPartCompositeProperties type exposes the following members.
Properties
Name | Description
CompositeBeamSlabMaterial
 The composite beam slab material.
CompositeBeamSlabThickness
 The composite beam slab thickness.
CompositeBeamType
 The composite beam type.
CompositeBeamWidthFromSpanFactor
 The composite beam width from span factor.
CompositeBeamWidthLeft
 The composite beam width left.
CompositeBeamWidthModeLeft
 The composite beam width mode left.
CompositeBeamWidthModeRight
 The composite beam width mode right.
CompositeBeamWidthRight
 The composite beam width right.
Top
See Also
Reference
AnalysisPartCompositeProperties Class
Tekla.Structures.Analysis Namespace